getwd()

#######################################################
## 문제 1. class_scores.csv을 데이터프레임으로 전환하시오
# 데이터프레임의 이름은 다음과 같이 하시오.
# scores
# R에서는 기본적으로 데이터파일안에 들어있는 문자열(Strings)를
# 요인(Factor)로 취급하는 것이 기본이다. 만약 요인으로 설정하지 않고
# 불러오고 싶다면 readCSV()함수내에 stringsAsFactors=FALSE; 를 추가한다.
#######################################################

scores <- data.frame(read.csv("class_scores.csv""))

#######################################################
## 문제 2. scores을 분석하시오
#######################################################

head(scores)
tail(scores)
summary(scores)
view(scores)

#######################################################
## 문제 3. scores 의 컬럼명을 한글로 전환하시오
## 학생아이디 = Stu_ID
## 학년 = grade
## 등급 = class
## 성별 = gender
## 수학 = Math
## 영어 = English
## 과학 = Science
## 마케팅 = Marketing
## 작문 = Writing
#######################################################

scores <- scores %>% 
  dplyr::rename(학번=Stu_ID,
                  학년=grade,
                  등급=class,
                  성별=gender,
                  수학=Math,
                  영어=English,
                  과학=Science,
                  마케팅=Marketing,
                  작문=Writing,
  )

head(scores)

#######################################################
## 문제 4. 1학년 학생들을 학번, 등급 , 성별 정렬 단,학번내림차순 정렬
#######################################################

scores %>% 
   dplyr::filter(학년 == 1) %>% 
   dplyr::select(학번,등급,성별) %>% 
   dplyr::arrange(학번)


#######################################################
## 문제 5. 1학년 남학생만 보기
#######################################################

scores %>% 
   dplyr::filter(학년 == 1, 성별 == 'M') %>% 
   dplyr::top_n(7)

#######################################################
## 문제 6. 1학년이 아닌 학생들 중 학번이
## 가장 빠른 번호 3개만 보기
## !grade == 1
## top_n(n=3,wt=수학)
## n은 상위 3개, wt 는 기준
#######################################################

scores %>% 
   dplyr::filter(!학년==1) %>% 
   dplyr::arrange(학번) %>% 
   dplyr::top_n(n=3,wt=수학)

#######################################################
## 문제 7. 1, 2학년 학생들을 학년,학번 순으
## grade == 1 | grade == 2
## arrange(학년,학번)
## tail 은 하단부분 6개만 보여줌
#######################################################

scores %>%
  dplyr::filter(학년==1 |학년==2) %>% 
  dplyr::arrange(학년,학번) %>%
tail

#######################################################
## 문제 8. 수학,영어,과학,마케팅,작문 과목의
## 평균을 나타내는 컬럼을 추가한 후
## 평균점수가 80이상인 학생들을 출력하시오.
## 단 평균내림차순, 학번오름차순으로 정렬하시오.
## mutate(평균 = (수학+영어+과학+마케팅+작문) %/% 5)
## 평균 >= 80
## getter, setter 개념설명
#######################################################

scores <- scores %>%
  dplyr::mutate(평균=(수학+영어+과학+마케팅+작문) %/% 5)
scores %>%
  dplyr::filter(평균>=80) %>% 
  dplyr::select(학번,평균) %>% 
  dplyr::arrange(desc(평균),학번)

#######################################################
## 문제 9. 학생들 중 한 과목이라도 100점이 있는
## 학생만 보기
## ※ | 를 연속사용하기
#######################################################

scores %>%
  dplyr::filter(수학==100|영어==100|과학==100|마케팅==100) %>% 
head

#######################################################
## 문제 10. 학번이 홀수인 학생들 중 남자이면서
## 수학과 과학이 모두 90점 이상인
## 학생들을 학번 오름차순으로 정렬
#######################################################

scores %>%
  dplyr::filter(학번%%2==1,성별=='M',수학>=90,과학>=90) %>% 
  dplyr::arrange(학번) %>% 
head



